package _02_abstract;

public class T00_abstract_class {

	public static void main(String[] args) {
		// 추상클래스란
		/*
		-클래스가 설계도라면 추상클래스는 '미완성 설계도'
		-추상메서드(미완성 메서드)를 포함하고 있는 클래스
		 	*추상메서드 : 선언부만 있고 구현부(몸통)가 없는 메서드
		 	
		-일반메서드가 추상메서드를 호출할 수 있다.(호출할 때 필요한 건 선언부)
		-완성된 설계도가 아니므로 인스턴스를 생성할 수 없다.
		-다른 클래스를 작성하는 데 도움을 줄 목적으로 작성된다.
		-앞에 abstract를 붙여서 사용
		- 클래스안에 한개라도 abstract 메서드가 있다면 클래스 앞에도 abstract를 붙여줘야한다
	
		*/

		// 추상클래스의 용도
		/*
		* 실체 클래스의 공통된 필드와 메소드의 이름 통일할 목적
			-실체 클래스를 설계자가 여러 사람일 경우
			-실체 클래스마다 필드와 메소드가 제각기 다른 이름을 가질 수 있음
			
		*실체 클래스를 작성할 때 시간 절약
		 	-실체 클래스는 추가적인 필드와 메소드만 선언
		*/

	
	
	
	  
	 
	  
	 
	
	
	
	
	}

}
